const mahadistdata = {
  "पुणे": [
    "आंबेगाव", "बारामती", "भोर", "दौंड", "हवेली", "इंदापूर",
    "जुन्नर", "खेड", "मुळशी", "पुरंदर", "शिरूर", "वेल्हे"
  ],
  "नाशिक": [
    "बागलाण", "चांदवड", "दिंडोरी", "इगतपुरी", "मालेगाव",
    "नांदगाव", "नाशिक", "पेठ", "सिन्नर", "त्र्यंबकेश्वर", "येवला"
  ],
  "मुंबई_शहर": [
    "मुंबई शहर"
  ],
  "मुंबई_उपनगर": [
    "अंधेरी", "बांद्रा", "बोरीवली", "दहिसर", "घाटकोपर",
    "गोरेगाव", "कांदिवली", "कुरार", "मालाड", "मुलुंड", "पोवई"
  ],
  "ठाणे": [
    "अंबरनाथ", "भिवंडी", "दिवा", "कल्याण", "मुरबाड",
    "शहापूर", "उल्हासनगर", "ठाणे", "डोंबिवली"
  ]
};

  // Add more districts and talukas here

export default mahadistdata;
